tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
brew "bash"
brew "bat"
brew "coreutils"
brew "fd"
brew "gh"
brew "git"
brew "gnupg"
brew "htop"
brew "jq"
brew "neovim"
brew "pinentry-mac"
brew "rbenv"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "vim"
brew "zsh"
cask "font-hack-nerd-font"
