brew "bash"
brew "bat"
brew "coreutils"
brew "fd"
brew "gh"
brew "git"
brew "gnupg"
brew "htop"
brew "jq"
brew "neovim"
brew "pinentry-mac"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "vim"
brew "zsh"
cask "font-hack-nerd-font"

brew "gpg"
brew "gawk"
brew "openssl@3"
brew "readline"
brew "libyaml"
brew "gmp"
brew "autoconf"
brew "sqlite3"
brew "xz"
brew "zlib"
brew "tcl-tk@8"
brew "libb2"

# Work stuff
brew "node_exporter"
cask "gcloud-cli"
cask "orbstack"
brew "kubectx"
cask "1password-cli"
brew "helm@3"
brew "kind"
brew "bats-core"
brew "gnu-sed"
brew "sops"
brew "k9s"
tap "calyptia/tap"
brew "calyptia"
brew "go"
brew "yq"
# Work is using a very specific version of mise at the moment, ugh
# brew "mise"
