# Brewfile — managed alongside the chezmoi dotfiles.
# Apply with `brew bundle --file=Brewfile` (bootstrap.sh does this on a fresh machine).
# Kept intentionally lean: daily tools + apps only. The full machine inventory
# (manual apps, mise-managed runtimes, macOS settings) lives in REIMAGE.md.

# ── Taps ──
tap "eugene1g/safehouse"
tap "calyptia/tap"

# ── Core CLI ──
brew "bash"
brew "zsh"
brew "coreutils"
brew "gawk"
brew "gnu-sed"
brew "fd"
brew "ripgrep"
brew "fzf"
brew "bat"
brew "jq"
brew "yq"
brew "htop"
brew "git"
brew "gh"
brew "chezmoi"
brew "starship"
brew "tmux"
brew "vim"
brew "neovim"
brew "gnupg"
brew "gpg"
brew "pinentry-mac"

# ── Dev: languages, LSPs, formatters ──
brew "mise"
brew "go"
brew "golangci-lint"
brew "gopls"
brew "lua-language-server"
brew "stylua"
brew "ruby-lsp"
brew "terraform-ls"
brew "typescript-language-server"
brew "yaml-language-server"
brew "tree-sitter-cli"
brew "cue"
brew "d2"

# ── Build deps / libraries (pinned intentionally; used to compile runtimes) ──
brew "autoconf"
brew "openssl@3"
brew "readline"
brew "libyaml"
brew "gmp"
brew "sqlite3"
brew "xz"
brew "zlib"
brew "tcl-tk@8"
brew "libb2"

# ── Work ──
brew "node_exporter"
brew "kubectx"
brew "helm@3"
brew "kind"
brew "k9s"
brew "bats-core"
brew "sops"
brew "argocd"
brew "calyptia"
cask "gcloud-cli"
cask "orbstack"
cask "1password-cli"

# ── Coding-agent sandbox ──
brew "agent-safehouse"

# ── Casks: apps ──
cask "claude-devtools"
cask "cursor"
cask "docker-desktop"
cask "ghostty"
cask "google-chrome"
cask "iterm2"
cask "obsidian"
cask "visual-studio-code"
cask "zoom"

# ── Fonts ──
cask "font-hack-nerd-font"
